Terraform Plan for terraform/eus/dev/frontend:

```
data.azurerm_container_app_environment.aca_env: Reading...
azurerm_container_app.backend: Refreshing state... [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/containerApps/opre-ops-dev-eus-be-ca]
data.azurerm_container_app_environment.aca_env: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.backend will be destroyed
  # (because azurerm_container_app.backend is not in configuration)
  - resource "azurerm_container_app" "backend" {
      - container_app_environment_id  = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/containerApps/opre-ops-dev-eus-be-ca" -> null
      - latest_revision_fqdn          = "opre-ops-dev-eus-be-ca--b159b54b.blackpond-5cf544be.eastus.azurecontainerapps.io" -> null
      - latest_revision_name          = "opre-ops-dev-eus-be-ca--b159b54b" -> null
      - location                      = "eastus" -> null
      - name                          = "opre-ops-dev-eus-be-ca" -> null
      - outbound_ip_addresses         = [
          - "52.188.141.165",
        ] -> null
      - resource_group_name           = "opre-ops-dev-eus-core-rg" -> null
      - revision_mode                 = "Multiple" -> null
      - tags                          = {} -> null

      - ingress {
          - allow_insecure_connections = false -> null
          - exposed_port               = 0 -> null
          - external_enabled           = true -> null
          - fqdn                       = "opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> null
          - target_port                = 8080 -> null
          - transport                  = "auto" -> null

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
            }
        }

      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - template {
          - max_replicas    = 10 -> null
          - min_replicas    = 1 -> null
          - revision_suffix = "b159b54b" -> null

          - container {
              - args              = [] -> null
              - command           = [] -> null
              - cpu               = 0.25 -> null
              - ephemeral_storage = "1Gi" -> null
              - image             = "ghcr.io/hhs/opre-ops/ops-backend:b159b54b7f41075f26913766ab1b5ca2977f0c2d" -> null
              - memory            = "0.5Gi" -> null
              - name              = "ops-backend" -> null

              - env {
                  - name  = "OPS_CONFIG" -> null
                  - value = "environment/azure/dev.py" -> null
                }
              - env {
                  - name  = "PGUSER" -> null
                  - value = "ops" -> null
                }
              - env {
                  - name        = "PGPASSWORD" -> null
                  - secret_name = "pgpassword" -> null
                }
              - env {
                  - name  = "PGHOST" -> null
                  - value = "opre-ops-dev-eus-db-psql.postgres.database.azure.com" -> null
                }
              - env {
                  - name  = "PGPORT" -> null
                  - value = "5432" -> null
                }
              - env {
                  - name  = "PGDATABASE" -> null
                  - value = "postgres" -> null
                }
              - env {
                  - name        = "JWT_PRIVATE_KEY" -> null
                  - secret_name = "jwt-private-key" -> null
                }
              - env {
                  - name  = "OPS_FRONTEND_URL" -> null
                  - value = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> null
                }
            }
        }
    }

  # azurerm_container_app.frontend will be created
  + resource "azurerm_container_app" "frontend" {
      + container_app_environment_id  = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "opre-ops-dev-eus-fe-ca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "opre-ops-dev-eus-core-rg"
      + revision_mode                 = "Multiple"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = "b15137f7"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/hhs/opre-ops/ops-frontend:b15137f7bbc32e924d9e8526e155c4bc96ae8a02"
              + memory            = "0.5Gi"
              + name              = "ops-frontend"

              + env {
                  + name  = "REACT_APP_BACKEND_DOMAIN"
                  + value = "https://opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - be_domain = "https://opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> null
  + domain    = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
  - fe_domain = "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io" -> null
```

Plan saved to GH artifacts.